#Introduction to SQL and Advanced
Functions | Assignment

1.  Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

-> DDL, DML, and DQL are categories of SQL commands with distinct purposes in database management.
DDL (Data Definition Language) commands are used to define, modify, and delete the structure of database objects like tables, indexes, and views. They deal with the schema of the database. Changes made by DDL commands are typically auto-committed and cannot be rolled back.
Example (DDL): Creating a table named Employees
    CREATE TABLE Employees (
        EmployeeID INT PRIMARY KEY,
        FirstName VARCHAR(50),
        LastName VARCHAR(50),
        Department VARCHAR(50)
    );
    DML (Data Manipulation Language) commands are used to manage and manipulate the data within database objects. They allow for inserting, updating, and deleting records in tables. Changes made by DML commands are not auto-committed and can be rolled back if part of a transaction.
Example (DML): Inserting a new employee record into the Employees table.
    INSERT INTO Employees (EmployeeID, FirstName, LastName, Department)
    VALUES (1, 'John', 'Doe', 'Sales');
    DQL (Data Query Language) commands are used to retrieve data from the database. The primary DQL command is SELECT, which allows you to query data from one or more tables based on specified criteria.
Example (DQL): Retrieving all employees from the Employees table who work in the 'Sales' department.
    SELECT EmployeeID, FirstName, LastName
    FROM Employees
    WHERE Department = 'Sales';

2.  What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

-> SQL constraints are rules applied to columns or tables in a database to enforce data integrity and maintain data accuracy and reliability. They restrict the type of data that can be entered into a table, ensuring that the stored information adheres to specific business rules and preventing inconsistencies.
Here are three common types of constraints:
PRIMARY KEY Constraint:
Description: A PRIMARY KEY uniquely identifies each record in a table. It must contain unique values and cannot contain NULL values. A table can only have one PRIMARY KEY.
Scenario: In a Customers table, the customer_id column would be an ideal candidate for a PRIMARY KEY. This ensures that each customer has a distinct identifier, preventing duplicate customer entries and allowing for efficient retrieval and referencing of individual customer records.

FOREIGN KEY Constraint:
Description: A FOREIGN KEY establishes a link between two tables. It ensures referential integrity by requiring that values in a column (or set of columns) in one table (the referencing table) match values in the PRIMARY KEY of another table (the referenced table).
Scenario: Consider an Orders table and a Customers table. The Orders table might have a customer_id column that refers to the customer_id (PRIMARY KEY) in the Customers table. A FOREIGN KEY constraint on customer_id in the Orders table would prevent creating an order for a customer_id that does not exist in the Customers table, thus maintaining the relationship between orders and customers.
UNIQUE Constraint:
Description: A UNIQUE constraint ensures that all values in a specified column (or set of columns) are distinct across all rows in the table. Unlike a PRIMARY KEY, a table can have multiple UNIQUE constraints, and a column with a UNIQUE constraint can contain NULL values (though only one NULL value is typically allowed, depending on the database system).
Scenario: In a Users table, an email_address column could have a UNIQUE constraint. This prevents multiple users from registering with the same email address, ensuring that each user has a unique contact point.

3. Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

-> The LIMIT and OFFSET clauses in SQL are used to control the number of rows returned by a query and the starting point of those rows.
LIMIT: This clause specifies the maximum number of rows that a query should return. It restricts the size of the result set. For example, LIMIT 10 would return at most 10 rows.
OFFSET: This clause specifies the number of rows to skip from the beginning of the result set before starting to return rows. It effectively shifts the starting point of the result set. For example, OFFSET 20 would skip the first 20 rows and begin returning results from the 21st row.
Retrieving the third page of results (10 records per page):
To retrieve the third page of results with 10 records per page, you would use LIMIT and OFFSET together as follows:
Code

SELECT *
FROM your_table_name
ORDER BY some_column -- Important for consistent results
LIMIT 10
OFFSET 20;
Explanation:
ORDER BY some_column: It is crucial to include an ORDER BY clause to ensure a consistent and predictable order of results. Without it, the database might return rows in an arbitrary order, and subsequent page requests could yield different results.
LIMIT 10: This specifies that you want to retrieve 10 records, which corresponds to the number of records per page.
OFFSET 20: To get the third page, you need to skip the first two pages. Since each page has 10 records, you skip (3 - 1) * 10 = 20 records.
This combination of LIMIT 10 OFFSET 20 will effectively return records 21 through 30 from your ordered result set, representing the third page of results.

4. What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.

-> A Common Table Expression (CTE) in SQL is a named, temporary result set derived from a simple SELECT statement, defined within the execution scope of a single SQL statement (e.g., SELECT, INSERT, UPDATE, DELETE, or MERGE). CTEs are not stored as objects in the database like views; their existence is limited to the duration of the query in which they are defined.
Main Benefits of CTEs:
Improved Readability and Organization: CTEs break down complex queries into smaller, logical, and more manageable units, making the SQL code easier to understand and follow, especially for multi-step data transformations.
Reduced Code Duplication: A CTE can be defined once and then referenced multiple times within the same query, eliminating the need to repeat subquery logic.
Enhanced Maintainability: By modularizing the query, CTEs simplify debugging and modifications, as changes to a specific logic block are isolated within the CTE definition.
Support for Recursive Queries: CTEs are essential for handling hierarchical data structures (e.g., organizational charts, bill of materials) through recursive queries.
Alternative to Views: For temporary, single-query use cases, CTEs can serve as a lightweight alternative to creating and managing database views.
Simple SQL Example Demonstrating CTE Usage:
Consider an Employees table with EmployeeID, Name, and Salary. The following example uses a CTE to find employees whose salary is above the average company salary.

In [ ]:
WITH AverageSalary AS (
    SELECT AVG(Salary) AS CompanyAverageSalary
    FROM Employees
)
SELECT
    e.Name,
    e.Salary
FROM
    Employees e
JOIN
    AverageSalary ASd ON e.Salary > ASd.CompanyAverageSalary;

5.  Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).

-> SQL Normalization is a database design technique used to organize tables and columns to minimize data redundancy and improve data integrity. Its primary goals are:
Reduce Data Redundancy: Eliminate duplicated data, saving storage space and preventing inconsistencies.
Improve Data Integrity: Ensure data accuracy and consistency by storing each piece of information in a single, well-defined location.
Enhance Data Consistency: Prevent update, insertion, and deletion anomalies that can arise from redundant data.
Facilitate Data Maintenance: Simplify the process of updating and managing data, as changes only need to be made in one place.
First Three Normal Forms (1NF, 2NF, 3NF):
First Normal Form (1NF):
Definition: A table is in 1NF if it contains no repeating groups of data and all attributes are atomic (indivisible). Each column must contain a single value, and each row must be unique, typically identified by a primary key.
Example: Instead of a single column "Phone Numbers" containing multiple phone numbers for a person, create separate rows or a separate table for each phone number.
Second Normal Form (2NF):
Definition: A table is in 2NF if it is in 1NF and all non-key attributes are fully functionally dependent on the entire primary key. This means that if a primary key is composite (made of multiple columns), no non-key attribute should depend on only a part of that composite key.
Example: In a Order_Details table with a composite primary key of (OrderID, ProductID), a ProductName attribute should not be in this table if it only depends on ProductID, not the entire (OrderID, ProductID) combination. ProductName should be in a separate Products table.
Third Normal Form (3NF):
Definition: A table is in 3NF if it is in 2NF and there are no transitive dependencies. A transitive dependency occurs when a non-key attribute is dependent on another non-key attribute, rather than directly on the primary key.
Example: In a Student table, if DepartmentName is dependent on DepartmentID, and DepartmentID is dependent on StudentID (the primary key), then DepartmentName has a transitive dependency on StudentID. To achieve 3NF, DepartmentName and DepartmentID should be moved to a separate Department table.

6.  Create a database named ECommerceDB and perform the following
tasks:
1. Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)
○ TotalAmount (DECIMAL(10,2))
2. Insert the following records into each table
● Categories
CategoryID Category Name
1 Electronics
2 Books
3 Home Goods
4 Apparel
● Products
ProductID ProductName CategoryID Price StockQuantity
101 Laptop Pro 1 1200.00 50
102 SQL
Handbook
2 45.50 200
103 Smart Speaker 1 99.99 150
104 Coffee Maker 3 75.00 80
105 Novel : The
Great SQL
2 25.00 120
106 Wireless
Earbuds
1 150.00 100
107 Blender X 3 120.00 60
108 T-Shirt Casual 4 20.00 300
● Customers
CustomerID CustomerName Email Joining Date
1 Alice Wonderland alice@example.com 2023-01-10
2 Bob the Builder bob@example.com 2022-11-25
3 Charlie Chaplin charlie@example.com 2023-03-01
4 Diana Prince diana@example.com 2021-04-26
 Orders
OrderID CustomerID OrderDate TotalAmount
1001 1 2023-04-26 1245.50
1002 2 2023-10-12 99.99
1003 1 2023-07-01 145.00
1004 3 2023-01-14 150.00
1005 2 2023-09-24 120.00
1006 1 2023-06-19 20.00

->Here are the SQL commands to create the ECommerceDB database, define the specified tables with appropriate data types and constraints, and insert all the required records.
The SQL dialect used here is standard SQL, which is compatible with most database management systems like MySQL, PostgreSQL, and SQL Server.
sql
-- 1. Create the ECommerceDB database (optional, depending on your environment)
CREATE DATABASE ECommerceDB;
USE ECommerceDB; -- Select the newly created database for subsequent operations
-- (Note: If using PostgreSQL, use \c ECommerceDB instead of USE ECommerceDB)
Use code with caution.

Task 1: Create Tables
sql
-- Create the Categories table
CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- Create the Products table
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10, 2) NOT NULL,
    StockQuantity INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- Create the Customers table
CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

-- Create the Orders table
CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10, 2),
    FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);
Use code with caution.

Task 2: Insert Records
sql
-- Insert records into the Categories table
INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

-- Insert records into the Products table
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel : The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

-- Insert records into the Customers table
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

-- Insert records into the Orders table
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

7. Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName

-> To generate the report, you would use a SQL query that performs a LEFT JOIN between the Customers table and the Orders table. This ensures that all customers are included, regardless of whether they have placed an order.

In [ ]:
SELECT
    C.CustomerName,
    C.Email,
    COUNT(O.OrderID) AS TotalNumberofOrders
FROM
    Customers C
LEFT JOIN
    Orders O ON C.CustomerID = O.CustomerID
GROUP BY
    C.CustomerID, C.CustomerName, C.Email
ORDER BY
    C.CustomerName;

Explanation
SELECT C.CustomerName, C.Email, COUNT(O.OrderID) AS TotalNumberofOrders: This selects the customer's name and email from the Customers table (C). COUNT(O.OrderID) counts the number of orders associated with each customer. Using COUNT(O.OrderID) (a column from the right table, Orders) ensures that customers without any matching orders (where O.OrderID would be NULL) are counted as 0.
FROM Customers C: Specifies the Customers table as the primary table (aliased as C).
LEFT JOIN Orders O ON C.CustomerID = O.CustomerID: This joins the Orders table (aliased as O) to the Customers table based on the CustomerID. The LEFT JOIN ensures all customers are retained in the result, even if they have no corresponding entries in the Orders table.
GROUP BY C.CustomerID, C.CustomerName, C.Email: This groups the results by customer to allow the COUNT() function to aggregate the orders for each unique customer. Grouping by the primary key (CustomerID) is sufficient in most SQL versions, but including CustomerName and Email in the GROUP BY clause is best practice for compatibility.
ORDER BY C.CustomerName: Sorts the final result alphabetically by the customer's name.

8.  Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically

-> To retrieve the ProductName, Price, StockQuantity, and CategoryName for all products, ordered by CategoryName and then ProductName alphabetically, a JOIN operation between the Products and Categories tables is required.
Assumptions:
There is a Products table with columns: ProductName, Price, StockQuantity, and a foreign key CategoryID.
There is a Categories table with columns: CategoryID (primary key) and CategoryName.

In [ ]:
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products AS p
JOIN
    Categories AS c ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;

9. Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

In [ ]:
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) as rn
    FROM
        Categories c
    JOIN
        Products p ON c.CategoryID = p.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    rn <= 2;

-> Explanation:
WITH RankedProducts AS (...): This defines a Common Table Expression (CTE) named RankedProducts.
SELECT c.CategoryName, p.ProductName, p.Price, ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) as rn:
This selects the CategoryName, ProductName, and Price from the Categories and Products tables.
ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) is the window function.
PARTITION BY c.CategoryName: This divides the data into partitions based on the CategoryName, meaning the ranking will restart for each category.
ORDER BY p.Price DESC: This orders the products within each category by their Price in descending order, so the most expensive products get lower row numbers.
as rn: This assigns the calculated row number to an alias rn.
FROM Categories c JOIN Products p ON c.CategoryID = p.CategoryID: This joins the Categories and Products tables on their common CategoryID to retrieve the necessary information.
SELECT CategoryName, ProductName, Price FROM RankedProducts WHERE rn <= 2;:
This final SELECT statement retrieves the desired columns from the RankedProducts CTE.
WHERE rn <= 2: This filters the results to include only the rows where the rn (row number) is 1 or 2, effectively selecting the top 2 most expensive products within each category.

10.  You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.
Using the Sakila database, answer the following business questions to support key strategic
initiatives.
Tasks & Questions:
1. Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
2. Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
3. Calculate how many films are available at each store and how many of those have
never been rented.
4. Show the total revenue per month for the year 2023 to analyze business seasonality.
5. Identify customers who have rented more than 10 times in the last 6 months.

-> The following SQL queries provide the data analysis requested by the Sakila Video Rentals management team:
1. Top 5 customers based on total amount spent
This query joins the customer, payment, and rental tables to aggregate spending per customer, then orders and limits the results. SELECT
    c.first_name,
    c.last_name,
    c.email,
    SUM(p.amount) AS total_amount_spent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name, c.email
ORDER BY
    total_amount_spent DESC
LIMIT 5;
2. Top 3 movie categories with the highest rental counts
This query links category, film_category, inventory, and rental tables to count rentals per category.
sql
SELECT
    cat.name AS category_name,
    COUNT(r.rental_id) AS rental_count
FROM
    category cat
JOIN
    film_category fc ON cat.category_id = fc.category_id
JOIN
    inventory i ON fc.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    cat.name
ORDER BY
    rental_count DESC
LIMIT 3;
3. Films available at each store and how many have never been rented
This query uses LEFT JOIN and conditional aggregation (SUM with CASE or COUNT with WHERE) to count total inventory and never-rented items per store.
sql
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS total_films_in_inventory,
    SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS never_rented_count
FROM
    store s
JOIN
    inventory i ON s.store_id = i.store_id
LEFT JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id;
    4. Total revenue per month for the year 2023
This query aggregates payments using YEAR() and MONTH() functions to analyze seasonality for a specific year (assuming data exists for 2023).
sql
SELECT
    YEAR(payment_date) AS rental_year,
    MONTH(payment_date) AS rental_month,
    SUM(amount) AS monthly_revenue
FROM
    payment
WHERE
    YEAR(payment_date) = 2023
GROUP BY
    rental_year, rental_month
ORDER BY
    rental_year, rental_month;
5. Customers who have rented more than 10 times in the last 6 months
This query uses date functions (CURDATE(), INTERVAL) and the HAVING clause to filter customers based on rental activity within the past six months.
sql
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS rentals_last_6_months
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(r.rental_id) > 10